Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_dac.c
  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GPIP_GPDAC_CH_B_SEL, src);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Select DAC channel A source
                                                                                *
                                                                                * @param  src: DAC channel A source selection type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void GPIP_Set_DAC_ChanA_SRC_SEL(GPIP_DAC_ChanA_SRC_Type src) {
  uint32_t tmpVal;

  CHECK_PARAM(IS_GPIP_DAC_CHANA_SRC_TYPE(src));

  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GPIP_GPDAC_CH_A_SEL, src);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Enable DAC channel B
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void GPIP_DAC_ChanB_Enable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPDAC_EN2);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Disable DAC channel B
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void GPIP_DAC_ChanB_Disable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_CONFIG);
  tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPDAC_EN2);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Enable DAC channel A
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void GPIP_DAC_ChanA_Enable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPDAC_EN);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Disable DAC channel A
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void GPIP_DAC_ChanA_Disable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_CONFIG);
  tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPDAC_EN);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Select DAC DMA TX format
                                                                                *
                                                                                * @param  fmt: DAC DMA TX format selection type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void GPIP_Set_DAC_DMA_TX_FORMAT_SEL(GPIP_DAC_DMA_TX_FORMAT_Type fmt) {
  uint32_t tmpVal;

  CHECK_PARAM(IS_GPIP_DAC_DMA_TX_FORMAT_TYPE(fmt));

  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_DMA_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GPIP_GPDAC_DMA_FORMAT, fmt);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_DMA_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Enable DAC DMA TX
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void GPIP_Set_DAC_DMA_TX_Enable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_DMA_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPDAC_DMA_TX_EN);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_DMA_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Disable DAC DMA TX
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void GPIP_Set_DAC_DMA_TX_Disable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_DMA_CONFIG);
  tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPDAC_DMA_TX_EN);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_DMA_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Disable DAC DMA TX
                                                                                *
                                                                                * @param  data: The data to be send
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void GPIP_DAC_DMA_WriteData(uint32_t data) { BL_WR_REG(GPIP_BASE, GPIP_GPDAC_DMA_WDATA, data); }

/****************************************************************************/ /**
                                                                                * @brief  AON and GPIP DAC config
                                                                                *
                                                                                * @param  cfg: AON and GPIP DAC configuration
                                                                                *
                                                                                * @return config success or not
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type GLB_GPIP_DAC_Init(GLB_GPIP_DAC_Cfg_Type *cfg) {
  uint32_t tmpVal;

