Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_dac.c
  CHECK_PARAM(IS_GLB_DAC_REF_SEL_TYPE(cfg->refSel));
  CHECK_PARAM(IS_GPIP_DAC_MOD_TYPE(cfg->div));
  CHECK_PARAM(IS_GPIP_DAC_DMA_TX_FORMAT_TYPE(cfg->dmaFmt));

  /* AON Set DAC config */
  tmpVal = BL_RD_REG(GLB_BASE, GLB_GPDAC_CTRL);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_GPDAC_REF_SEL, cfg->refSel);

  if (ENABLE == cfg->resetChanA) {
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_GPDACA_RSTN_ANA);
    tmpVal = BL_WR_REG(GLB_BASE, GLB_GPDAC_CTRL, tmpVal);
    __NOP();
    __NOP();
    __NOP();
    __NOP();
  }

  if (ENABLE == cfg->resetChanB) {
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_GPDACB_RSTN_ANA);
    tmpVal = BL_WR_REG(GLB_BASE, GLB_GPDAC_CTRL, tmpVal);
    __NOP();
    __NOP();
    __NOP();
    __NOP();
  }

  /* AON Clear reset */
  tmpVal = BL_SET_REG_BIT(tmpVal, GLB_GPDACA_RSTN_ANA);
  tmpVal = BL_SET_REG_BIT(tmpVal, GLB_GPDACB_RSTN_ANA);
  tmpVal = BL_WR_REG(GLB_BASE, GLB_GPDAC_CTRL, tmpVal);

  /* GPIP Set DAC config */
  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GPIP_GPDAC_MODE, cfg->div);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_CONFIG, tmpVal);

  /* GPIP Set DMA config */
  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_DMA_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GPIP_GPDAC_DMA_TX_EN, cfg->dmaEn);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GPIP_GPDAC_DMA_FORMAT, cfg->dmaFmt);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_DMA_CONFIG, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  AON and GPIP DAC channel A config
                                                                                *
                                                                                * @param  cfg: AON and GPIP DAC channel A configuration
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void GLB_GPIP_DAC_Set_ChanA_Config(GLB_GPIP_DAC_ChanA_Cfg_Type *cfg) {
  uint32_t tmpVal;

  CHECK_PARAM(IS_GPIP_DAC_CHANA_SRC_TYPE(cfg->src));

  /* GPIP select source */
  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GPIP_GPDAC_CH_A_SEL, cfg->src);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_CONFIG, tmpVal);

  /* GPIP enable or disable channel */
  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GPIP_GPDAC_EN, cfg->chanEn);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_CONFIG, tmpVal);

  /* AON enable or disable channel */
  tmpVal = BL_RD_REG(GLB_BASE, GLB_GPDAC_ACTRL);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_GPDAC_IOA_EN, cfg->outputEn);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_GPDAC_A_EN, cfg->chanCovtEn);
  tmpVal = BL_WR_REG(GLB_BASE, GLB_GPDAC_ACTRL, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  AON and GPIP DAC channel B config
                                                                                *
                                                                                * @param  cfg: AON and GPIP DAC channel B configuration
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void GLB_GPIP_DAC_Set_ChanB_Config(GLB_GPIP_DAC_ChanB_Cfg_Type *cfg) {
  uint32_t tmpVal;

  CHECK_PARAM(IS_GPIP_DAC_CHANB_SRC_TYPE(cfg->src));

  /* GPIP select source */
  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GPIP_GPDAC_CH_B_SEL, cfg->src);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_CONFIG, tmpVal);

  /* GPIP enable or disable channel */
  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPDAC_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GPIP_GPDAC_EN2, cfg->chanEn);
  BL_WR_REG(GPIP_BASE, GPIP_GPDAC_CONFIG, tmpVal);

  /* AON enable or disable channel */
  tmpVal = BL_RD_REG(GLB_BASE, GLB_GPDAC_BCTRL);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_GPDAC_IOB_EN, cfg->outputEn);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_GPDAC_B_EN, cfg->chanCovtEn);
  tmpVal = BL_WR_REG(GLB_BASE, GLB_GPDAC_BCTRL, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  DAC channel A set value
                                                                                *
                                                                                * @param  val: DAC value
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void GLB_DAC_Set_ChanA_Value(uint16_t val) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(GLB_BASE, GLB_GPDAC_DATA);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_GPDAC_A_DATA, val);
  tmpVal = BL_WR_REG(GLB_BASE, GLB_GPDAC_DATA, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  DAC channel B set value
                                                                                *
                                                                                * @param  val: DAC value
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void GLB_DAC_Set_ChanB_Value(uint16_t val) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(GLB_BASE, GLB_GPDAC_DATA);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_GPDAC_B_DATA, val);
  tmpVal = BL_WR_REG(GLB_BASE, GLB_GPDAC_DATA, tmpVal);
}

/*@} end of group DAC_Public_Functions */

/*@} end of group DAC */

/*@} end of group BL702_Peripheral_Driver */
